Project/Toir.Adaptation/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/торо_ЗакрытиеЗаявокИРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ЗакрытиеЗаявокИРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1956cb75-56b8-44d3-8976-c6da63c7e472">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e6ff1a5-fcd3-468d-afb2-4548864e1036">
    <name>ДатаАктуальности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e3a25bb8-46cc-47c7-88ab-d8638955a412">
    <name>ППРИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="42802afd-70ab-4cd7-9b79-5e87db6590e0">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="007823c2-bb3a-4d9b-87d1-b5d3444f3df5">
    <name>ЗакрываемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="76a060af-30f2-4d31-a1e0-f17789c677b6">
      <name>Перенесен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ad8bf9c9-0087-44cc-849d-67c3762f7c6f">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="350c3b6f-c76f-4d49-957e-0ce792d0ed05">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af553d9d-972c-4298-b6a4-887e960089ef">
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="32713c10-0fa0-41cc-850c-655be40da2d9">
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="189e7549-3f0c-418a-b4e1-57ef1a2dcf23">
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0160c88d-a1cc-4915-9cef-f895a1ca119d">
      <name>Отменен</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="049f70c2-3f4f-41b2-a503-10a28b152fa7">
      <name>НоваяДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="23b56d4f-7c04-4bfd-9a20-3ea25aa83315">
      <name>НоваяДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="0a8c9a08-a4ae-4fd5-8f1e-f1fb945a37f4">
      <name>ПричинаЗакрытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40f5f639-3326-4442-93c7-db72bc8c2b5e">
      <name>ДокументОснование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1b6212e2-26ba-4550-804d-6c85664e4b5a">
    <name>ЗакрываемыеЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b37a7dd6-3d54-4079-a8c7-1c03548f8537">
      <name>Заявка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1afb4107-068f-4994-98dd-e2872c1878ab">
      <name>ПричинаЗакрытия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes>
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8cd050f-96b8-4025-804f-118eec0e9fd4">
    <name>гкс_ЭтоПереносРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1700dbd9-5fec-4508-82e9-7c68a672f6b8">
  <name>торо_ЗаявкиПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="d7dfab1a-d04f-4eef-b624-41857ac954b6">
    <name>ДатаНачалаРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="56b7ecd8-6f82-48c0-a5e4-6b0ed35d9be8">
    <name>ДатаОкончанияРемонтныхРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="c0f853e5-15d1-47ec-90ea-b70fc2292634">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="57cc77f3-0f99-4c18-8855-e9f9bb166844">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="63334144-1754-4ddf-bae4-01a96dcb2829">
    <name>УточнениеИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/торо_ЗакрытиеЗаявокИРемонтов/Forms/гкс_МассовыйПереносЗаявок/Module.bsl
// гкс+ [11.22] Деснол 17.11.2022
#Область ОбработчикиСобытийФормы

// гкс+ [12.22] Деснол 12.12.2022
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ГруппаВвод,);
КонецПроцедуры // гкс- [12.22] Деснол 12.12.2022

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "гкс_ПодборРемонта" Тогда 
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда 
			Если ТаблицаРемонтов.НайтиСтроки(Новый Структура("ИД", Параметр.ИД)).Количество() = 0 Тогда 
				НоваяСтрока = ТаблицаРемонтов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПеренестиРемонты(Команда)
	Если ТаблицаРемонтов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПеренестиРемонтыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	СтруктураФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Документ.торо_ЗакрытиеЗаявокИРемонтов.Форма.гкс_ПодборРемонтов",, 
		ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
       
&НаСервере
Процедура ПеренестиРемонтыНаСервере()
	ДобавитьСекунд = 0;
	Если Не ЭтотОбъект["гкс_СдвигЧП"] = 0 Тогда 
		ДобавитьСекунд = (ЭтотОбъект["гкс_СдвигЧП"] * -3600);
	КонецЕсли;
	СтрокиУдаленияИзТаблицы = Новый Массив();
	МассивПеренесенных = Новый Массив();
	Для Каждого СтрокаТЧ Из ТаблицаРемонтов Цикл
		Если СтрокаТЧ.ДатаНачала = СтрокаТЧ.НоваяДатаНачала ИЛИ Не ЗначениеЗаполнено(СтрокаТЧ.НоваяДатаНачала)
			ИЛИ Не ЗначениеЗаполнено(СтрокаТЧ.НоваяДатаОкончания) Тогда 
			// если не изменилась то и переносить не нужно
			Продолжить;
		КонецЕсли;
		СтрокиУдаленияИзТаблицы.Добавить(СтрокаТЧ);
		
		НЗ = РегистрыСведений.торо_АктуальныеПлановыеДатыРемонтов.СоздатьМенеджерЗаписи();
		НЗ.IDРемонта = СтрокаТЧ.ИД;
		НЗ.ДокументОснование = СтрокаТЧ.ДокументОснование;
		// гкс+ [02.23] Деснол 06.02.2023
		Если ЗначениеЗаполнено(СтрокаТЧ.Заявка) Тогда 
			НЗ.ДокументОснование = СтрокаТЧ.Заявка;
		Иначе
			НЗ.ДокументОснование = СтрокаТЧ.ДокументОснование;
		КонецЕсли;
		// гкс- [02.23] Деснол 06.02.2023
		НЗ.ДокументНачалаЦепочки = СтрокаТЧ.ДокументОснование;
		НЗ.ОбъектРемонта = СтрокаТЧ.ОР;
		НЗ.ДатаНачала = СтрокаТЧ.НоваяДатаНачала + ДобавитьСекунд;
		НЗ.ДатаОкончания = СтрокаТЧ.НоваяДатаОкончания + ДобавитьСекунд;
		НЗ.КрайняяДатаЗавершения = НЗ.ДатаОкончания;
		НЗ.гкс_ЭтоПереносРемонта = Истина;
		НЗ.Записать();
		МассивПеренесенных.Добавить(СтрокаТЧ.ИД);
	КонецЦикла;
	//
	Если МассивПеренесенных.Количество() Тогда
		СобытиеСсылка = Константы.гкс_СобытиеПереносРемонтаЗаявки.Получить();
		Если ЗначениеЗаполнено(СобытиеСсылка) Тогда 
		// найти заявки по ремонтам и сформировать уведомления
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта КАК ИД,
		               |	МАКСИМУМ(РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор) КАК Ссылка
		               |ИЗ
		               |	РегистрСведений.торо_ЗаявкиПоРемонтам КАК РегистрСведенийторо_ЗаявкиПоРемонтам
		               |ГДЕ
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта В(&ИД)
		               |	И РегистрСведенийторо_ЗаявкиПоРемонтам.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	РегистрСведенийторо_ЗаявкиПоРемонтам.IDРемонта";
		Запрос.УстановитьПараметр("ИД", МассивПеренесенных);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивСвойств = Новый Массив();
				НайдСтр = ТаблицаРемонтов.НайтиСтроки(Новый Структура("ИД", Выборка.ИД));
				Если НайдСтр.Количество() > 0 Тогда 
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаНачала", НайдСтр[0].НоваяДатаНачала + ДобавитьСекунд));
					МассивСвойств.Добавить(Новый Структура("Ключ,Значение", "НоваяДатаОкончания", НайдСтр[0].НоваяДатаОкончания + ДобавитьСекунд));
				КонецЕсли;
				торо_РаботаСУведомлениями.гкс_ЗаписатьУведомленияСрокаСогласования(Выборка.Ссылка, СобытиеСсылка, Новый Массив(), , МассивСвойств);
			КонецЦикла;
		КонецЕсли;
		//
		КонецЕсли;
	КонецЕсли;
	//
	Для Каждого СМ Из СтрокиУдаленияИзТаблицы Цикл
		ТаблицаРемонтов.Удалить(СМ);
	КонецЦикла;
	//ТаблицаРемонтов.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОтменитьРемонтыНаСервереЧерезДокумент()
	НовыйДокумент = Документы.торо_ЗакрытиеЗаявокИРемонтов.СоздатьДокумент();
	НовыйДокумент.Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнаяОрганизация", Истина);
	НовыйДокумент.Ответственный = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "ОсновнойОтветственный", Справочники.Пользователи.ПустаяСсылка());	
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.ДатаАктуальности = НовыйДокумент.Дата;
	Для Каждого СтрокаТЧ Из ТаблицаРемонтов Цикл
		Если СтрокаТЧ.ДатаНачала = СтрокаТЧ.НоваяДатаНачала ИЛИ Не ЗначениеЗаполнено(СтрокаТЧ.ДатаНачала) Тогда 
			// если не изменилась то и переносить не нужно
			Продолжить;
		КонецЕсли;
		НоваяСтрока = НовыйДокумент.ЗакрываемыеРемонты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ОбъектРемонта = СтрокаТЧ.ОР;
		НоваяСтрока.ВидРемонта = СтрокаТЧ.ВР;
		НоваяСтрока.ID = СтрокаТЧ.ИД;
		НоваяСтрока.Перенесен = Истина;
		//
		НоваяСтрока = НовыйДокумент.ЗакрываемыеЗаявки.Добавить();
		НоваяСтрока.ИДРемонта = СтрокаТЧ.ИД;
		НоваяСтрока.Заявка = СтрокаТЧ.Заявка;
		НоваяСтрока.ПричинаЗакрытия = Справочники.торо_ПричиныЗакрытияЗаявок.ПереносРемонта;
	КонецЦикла;
	НовыйДокумент.ДополнительныеСвойства.Вставить("ИзОбработки", Истина);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	ТаблицаРемонтов.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтроке(Команда)
	Если р_НоваяДатаОкончания < р_НоваяДатаНачала Тогда 
		р_НоваяДатаОкончания = р_НоваяДатаНачала;
	КонецЕсли;
	ТекДанные = Элементы.ТаблицаРемонтов.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда 
		ТекДанные.НоваяДатаНачала = р_НоваяДатаНачала;
		ТекДанные.НоваяДатаОкончания = р_НоваяДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсем(Команда)
	Если р_НоваяДатаОкончания < р_НоваяДатаНачала Тогда 
		р_НоваяДатаОкончания = р_НоваяДатаНачала;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из ТаблицаРемонтов Цикл
		СтрокаТаблицы.НоваяДатаНачала = р_НоваяДатаНачала;
		СтрокаТаблицы.НоваяДатаОкончания = р_НоваяДатаОкончания;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРемонтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТаблицаРемонтовЗаявка" Тогда 
		ТекДанные = Элементы.ТаблицаРемонтов.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда 
			ПоказатьЗначение(, ТекДанные.Заявка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
// гкс- [11.22] Деснол 17.11.2022
